In [1]:
import pandas as pd
import re
import numpy as np

In [2]:
df = pd.read_csv('/Users/Maria/Desktop/test3.csv', sep=';', index_col = 0)

/usr/local/Cellar/ipython/7.5.0/libexec/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3049: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df.head()
#print(len(df))

,Title,Number_of_Views,Rating,Category_1,Category_2,Category_3,Website,Unnamed: 8
index,,,,,,,,
0,Tease then suck,127450,84.0,Blowjob,NaN,NaN,Pornhub,NaN
1,Two hot chick on one dick,480620,79.0,Threesome,NaN,NaN,Pornhub,NaN
2,Chick stretches her pussy and blows for the cam,99720,77.0,Brunette,NaN,NaN,Pornhub,NaN
3,Fucking my neighbour,598820,80.0,Blonde,MILF,NaN,Pornhub,NaN
4,Small titted whore sucking a cock for lunch,155850,79.0,POV,NaN,NaN,Pornhub,NaN

In [4]:
df_g = pd.DataFrame(df.groupby('Category_1', as_index = False).count())

In [5]:
df.loc[df['Category_1']=='Feet']

,Title,Number_of_Views,Rating,Category_1,Category_2,Category_3,Website,Unnamed: 8
index,,,,,,,,
48112,Nyli Says Happy Canada Day,261090,73.0,Feet,NaN,NaN,Pornhub,NaN
171184,Intimate Sex Between Two College Students,6130000,81.0,Feet,NaN,NaN,Pornhub,NaN
180603,Me and My 2 Angels 2 - Scene 4,216130,72.0,Feet,NaN,NaN,Pornhub,NaN

In [6]:
df_g.drop(columns = ['Number_of_Views', 'Rating', 'Category_2', 'Category_3','Website', 'Unnamed: 8'], inplace = True)

In [7]:
df_g.columns = ['Category', 'Count1']

df_g.head()
df_g['Count1'].sum()

342398

In [8]:
df_g2 = pd.DataFrame(df.groupby('Category_2', as_index = False).count())

In [9]:
df_g2.drop(columns = ['Number_of_Views', 'Rating', 'Category_1', 'Category_3','Website', 'Unnamed: 8'], inplace = True)

In [10]:
df_g2.columns = ['Category', 'Count2']
df_g2.head()

            Category  Count2
0              60fps     127
1                 69       2
2            Amateur   17526
3               Anal    8601
4  Anal Masturbation     388

In [11]:
df_g3 = pd.DataFrame(df.groupby('Category_3', as_index = False).count())

In [12]:
df_g3.drop(columns = ['Number_of_Views', 'Rating', 'Category_1', 'Category_2','Website', 'Unnamed: 8'], inplace = True)

In [13]:
df_g3.columns = ['Category', 'Count3']

In [14]:
df_final_count0 = df_g.merge(df_g2, on='Category', how ='outer')

In [15]:
df_final = df_final_count0.merge(df_g3, on = 'Category', how ='outer')

In [16]:
df_final.head()

  Category   Count1   Count2  Count3
0       3D     40.0      NaN     NaN
1    60fps     97.0    127.0    91.0
2       69    498.0      2.0     1.0
3  Amateur  47470.0  17526.0  7528.0
4     Anal  12464.0   8601.0  6292.0

In [17]:
df_final['Count1'].sum()

342398.0

In [18]:
df_final.fillna(0, inplace = True)

In [19]:
df_final['Count_Total'] = df_final['Count1'] +  df_final['Count2'] +  df_final['Count3']

In [20]:
df_final

        Category   Count1   Count2  Count3  Count_Total
0             3D     40.0      0.0     0.0         40.0
1          60fps     97.0    127.0    91.0        315.0
2             69    498.0      2.0     1.0        501.0
3        Amateur  47470.0  17526.0  7528.0      72524.0
4           Anal  12464.0   8601.0  6292.0      27357.0
..           ...      ...      ...     ...          ...
236     Homemade      0.0      0.0     1.0          1.0
237     Oriental      0.0      0.0     5.0          5.0
238       Police      0.0      0.0     2.0          2.0
239      Trimmed      0.0      0.0     3.0          3.0
240  Young & Old      0.0      0.0     1.0          1.0

[241 rows x 5 columns]

In [42]:
df_V = pd.DataFrame(df.groupby('Category_1', as_index = False).sum())

In [47]:
df_V.drop(columns = 'Rating', inplace = True)
#df_V.head()

In [48]:
df_V.columns = ['Category', 'Total_views']
df_V.columns

Index(['Category', 'Total_views'], dtype='object')

In [49]:
df_final = df_final.merge(df_V, on = 'Category', how ='outer')

In [50]:
df_final.head()

  Category   Count1   Count2  Count3  Count_Total   Total_views
0       3D     40.0      0.0     0.0         40.0  2.807189e+06
1    60fps     97.0    127.0    91.0        315.0  3.695958e+07
2       69    498.0      2.0     1.0        501.0  8.131108e+07
3  Amateur  47470.0  17526.0  7528.0      72524.0  1.508325e+10
4     Anal  12464.0   8601.0  6292.0      27357.0  4.808211e+09

In [51]:
df_final.drop(columns = ['Count1', 'Count2', 'Count3'], inplace = True)

In [52]:
df_final.head()

  Category  Count_Total   Total_views
0       3D         40.0  2.807189e+06
1    60fps        315.0  3.695958e+07
2       69        501.0  8.131108e+07
3  Amateur      72524.0  1.508325e+10
4     Anal      27357.0  4.808211e+09

In [53]:
df_R = pd.DataFrame(df.groupby('Category_1', as_index = False).mean())

In [54]:
df_R.head()

  Category_1  Number_of_Views     Rating
0         3D     70179.725000  71.650000
1      60fps    381026.587629  73.030928
2         69    163275.261044  80.190763
3    Amateur    317608.916193  74.860337
4       Anal    385458.596120  79.202806

In [55]:
df_R.drop(columns = 'Number_of_Views', inplace = True)

In [56]:
df_R.columns = ['Category', 'Avg_Rating']

In [57]:
df_final = df_final.merge(df_R, on = 'Category', how ='outer')

In [58]:
df_final.head()

  Category  Count_Total   Total_views  Avg_Rating
0       3D         40.0  2.807189e+06   71.650000
1    60fps        315.0  3.695958e+07   73.030928
2       69        501.0  8.131108e+07   80.190763
3  Amateur      72524.0  1.508325e+10   74.860337
4     Anal      27357.0  4.808211e+09   79.202806

In [59]:
df_final.to_csv('category_grouped.csv')